app/controllers/api/v1/users_controller.rb

     def index
      @users = User.all
        @formatted_users = @users.map { |user| format_user(user) }
---
SELECT "users".* FROM "users"